// ConsoleApplication11.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include<iostream>
using namespace std;
class Pen {
private:
	string Color;
public:
	string getColor();
	void setColor(string newColor)
	{
		if (newColor.length() != 6)
			Color = "000000"; // если ошибка, то чёрный цвет
		else Color = newColor;
	}

};
string Pen::getColor() { return Color; }


int main() {
	setlocale(LC_ALL, "ru");
	cout << "Тест номер 1: " << endl;
	Pen pen;
	pen.setColor("FFF0FF");
	cout << pen.getColor() << endl;

	return 0;
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
